DataProcessors/ЗаполнениеПланаРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеПланаРесурсов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПлановыеЦеныНаРесурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеЦеныНаРесурсы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПрошлогоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПрошлогоПериодаСоСтатьей103</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПрошлогоПериодаСоцПакет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗаполнениеПланаРесурсов/Forms/Форма/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Договор") Тогда
		Объект.Договор = Параметры.Договор;
		Объект.Сценарий = Параметры.Договор.Сценарий;
	КонецЕсли; 
	ПерезаполнитьТаблицы();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ПерезаполнитьТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	ПересчитатьЦены();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьИзмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	
	ДоговорОбъект = Объект.Договор.ПолучитьОбъект();
	ДоговорОбъект.Персонал.Загрузить(Персонал.Выгрузить());
	ДоговорОбъект.Деньги.Загрузить(Деньги.Выгрузить());
	ДоговорОбъект.Материалы.Загрузить(Материалы.Выгрузить());
	ДоговорОбъект.Инструменты.Загрузить(Инструменты.Выгрузить());
	ДоговорОбъект.Сценарий = Объект.Сценарий;
	ДоговорОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ТЧ_Персонал

&НаКлиенте
Процедура ПерсоналДолжностьПриИзменении(Элемент)
	Стр			= Элементы.Персонал.ТекущиеДанные;
	Стр.Цена	= ПолучитьЦенуНаРесурс(Объект.Организация, Объект.Сценарий, Стр.Должность, ТекущаяДата()); 
	ОбработатьСтрокуПерсонал();
КонецПроцедуры

&НаКлиенте
Процедура ПерсоналКоличествоСтавокПриИзменении(Элемент)
	ОбработатьСтрокуПерсонал();
КонецПроцедуры

&НаКлиенте
Процедура ПерсоналКоличествоЧасовПриИзменении(Элемент)
	ОбработатьСтрокуПерсонал();
КонецПроцедуры

&НаКлиенте
Процедура ПерсоналЦенаПриИзменении(Элемент)
	ОбработатьСтрокуПерсонал();
КонецПроцедуры

&НаКлиенте
Процедура ПерсоналСуммаПриИзменении(Элемент)
	ОбработатьСтрокуПерсонал();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуПерсонал()
	Стр = Элементы.Персонал.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.КоличествоСтавок * Стр.КоличествоЧасов;	
КонецПроцедуры

#КонецОбласти

#Область ТЧ_Деньги

#КонецОбласти

#Область ТЧ_Инструменты

&НаКлиенте
Процедура ИнструментыИнструментПриИзменении(Элемент)
	Стр			= Элементы.Инструменты.ТекущиеДанные;
	Стр.Цена	= ПолучитьЦенуНаРесурс(Объект.Организация, Объект.Сценарий, Стр.Инструмент, ТекущаяДата()); 
	ОбработатьСтрокуИнструменты();
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыКоличествоЧасовПриИзменении(Элемент)
	ОбработатьСтрокуИнструменты();
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыЦенаПриИзменении(Элемент)
	ОбработатьСтрокуИнструменты();
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыСуммаПриИзменении(Элемент)
	ОбработатьСтрокуИнструменты();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуИнструменты()
	Стр = Элементы.Инструменты.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.КоличествоЧасов;	
КонецПроцедуры

#КонецОбласти

#Область ТЧ_Материалы

&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	Стр			= Элементы.Материалы.ТекущиеДанные;
	Стр.Цена	= ПолучитьЦенуНаРесурс(Объект.Организация, Объект.Сценарий, Стр.Материал, ТекущаяДата()); 
	ОбработатьСтрокуМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ОбработатьСтрокуМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ОбработатьСтрокуМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаПриИзменении(Элемент)
	ОбработатьСтрокуМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуМатериалы()
	Стр = Элементы.Материалы.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ПерезаполнитьТаблицы()
	
	Объект.Организация = Объект.Организация;
	
	Персонал.Загрузить(Объект.Договор.Персонал.Выгрузить());
	Деньги.Загрузить(Объект.Договор.Деньги.Выгрузить());
	Инструменты.Загрузить(Объект.Договор.Инструменты.Выгрузить());
	Материалы.Загрузить(Объект.Договор.Материалы.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеСтатьиЗатрат(Команда)
	ВыбраннаяСтатьяЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ЗаполнитьВсеСтатьиЗатратЗавершение", ЭтотОбъект, Новый Структура("ВыбраннаяСтатьяЗатрат", ВыбраннаяСтатьяЗатрат)), ВыбраннаяСтатьяЗатрат,"Выберите статью затрат",Тип("СправочникСсылка.СтатьиЗатрат"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеСтатьиЗатратЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	ВыбраннаяСтатьяЗатрат = ?(Значение = Неопределено, ДополнительныеПараметры.ВыбраннаяСтатьяЗатрат, Значение);
	
	Если Значение = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаПерсонал Тогда 
		ОбрабатываемаяТаблица = Объект.Персонал;
	ИначеЕсли Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаДеньги Тогда
		ОбрабатываемаяТаблица = Объект.Деньги;
	ИначеЕсли Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаИнструменты Тогда
		ОбрабатываемаяТаблица = Объект.Инструменты;
	ИначеЕсли Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаМатериалы Тогда
		ОбрабатываемаяТаблица = Объект.Материалы;
	Иначе
		Возврат
	КонецЕсли;
	
	Для Каждого Стр Из ОбрабатываемаяТаблица Цикл
		Стр.СтатьяЗатрат = ВыбраннаяСтатьяЗатрат;	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыбранныеСтатьиЗатрат(Команда)
	ВыбраннаяСтатьяЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ЗаполнитьВыбранныеСтатьиЗатратЗавершение", ЭтотОбъект, Новый Структура("ВыбраннаяСтатьяЗатрат", ВыбраннаяСтатьяЗатрат)), ВыбраннаяСтатьяЗатрат,"Выберите статью затрат",Тип("СправочникСсылка.СтатьиЗатрат"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыбранныеСтатьиЗатратЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	ВыбраннаяСтатьяЗатрат = ?(Значение = Неопределено, ДополнительныеПараметры.ВыбраннаяСтатьяЗатрат, Значение);
	
	Если Значение = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаПерсонал Тогда 
		ОбрабатываемаяТаблица = Персонал;
		МассивИдентификаторов = Элементы.Персонал.ВыделенныеСтроки;
	ИначеЕсли Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаДеньги Тогда
		ОбрабатываемаяТаблица = Деньги;
		МассивИдентификаторов = Элементы.Деньги.ВыделенныеСтроки;
	ИначеЕсли Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаИнструменты Тогда
		ОбрабатываемаяТаблица = Инструменты;
		МассивИдентификаторов = Элементы.Инструменты.ВыделенныеСтроки;
	ИначеЕсли Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаМатериалы Тогда
		ОбрабатываемаяТаблица = Материалы;
		МассивИдентификаторов = Элементы.Материалы.ВыделенныеСтроки;
	Иначе
		Возврат
	КонецЕсли;
	
	Для Каждого ЭлементМассиваВыделенных Из МассивИдентификаторов Цикл
		Стр = ОбрабатываемаяТаблица.НайтиПоИдентификатору(ЭлементМассиваВыделенных);
		Если Стр <> Неопределено Тогда 
			Стр.СтатьяЗатрат = ВыбраннаяСтатьяЗатрат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустыеСтатьиЗатрат(Команда)
	ВыбраннаяСтатьяЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ЗаполнитьПустыеСтатьиЗатратЗавершение", ЭтотОбъект, Новый Структура("ВыбраннаяСтатьяЗатрат", ВыбраннаяСтатьяЗатрат)), ВыбраннаяСтатьяЗатрат,"Выберите статью затрат",Тип("СправочникСсылка.СтатьиЗатрат"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустыеСтатьиЗатратЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	ВыбраннаяСтатьяЗатрат = ?(Значение = Неопределено, ДополнительныеПараметры.ВыбраннаяСтатьяЗатрат, Значение);
	
	Если Значение = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаПерсонал Тогда 
		ОбрабатываемаяТаблица = Объект.Персонал;
	ИначеЕсли Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаДеньги Тогда
		ОбрабатываемаяТаблица = Объект.Деньги;
	ИначеЕсли Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаИнструменты Тогда
		ОбрабатываемаяТаблица = Объект.Инструменты;
	ИначеЕсли Элементы.ГруппаСтраницыПланПоРесурсам.ТекущаяСтраница = Элементы.ГруппаМатериалы Тогда
		ОбрабатываемаяТаблица = Объект.Материалы;
	Иначе
		Возврат
	КонецЕсли;
	
	Для Каждого Стр Из ОбрабатываемаяТаблица Цикл
		Если Не ЗначениеЗаполнено(Стр.СтатьяЗатрат) Тогда 
			Стр.СтатьяЗатрат = ВыбраннаяСтатьяЗатрат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНаРесурс(Организация, Сценарий, Ресурс, ДатаРасчета = Неопределено)  
	
	Если Не ЗначениеЗаполнено(ДатаРасчета) Тогда 
		ДатаРасчета = ТекущаяДата();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеЦеныНаРесурсыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ПлановыеЦеныНаРесурсы.СрезПоследних(
		|			&ДатаРасчета,
		|			Организация = &Организация
		|				И Ресурс = &Ресурс
		|				И Сценарий = &Сценарий) КАК ПлановыеЦеныНаРесурсыСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаРасчета",	ДатаРасчета);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Ресурс",			Ресурс);
	Запрос.УстановитьПараметр("Сценарий",		Сценарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Цена
	КонецЦикла;
	
	Возврат 0

КонецФункции

&НаКлиенте
Процедура ПересчитатьЦены()
	
	Если Персонал.Количество() = 0 И Материалы.Количество() = 0 И Инструменты.Количество() = 0 Тогда 
		Возврат	
	КонецЕсли;
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПересчитатьЦеныЗавершение", ЭтотОбъект), "Изменилась организация и/или сценарий. Пересчитать цены?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦеныЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПересчитатьЦеныНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦеныНаСервере()
	
	Для Каждого Стр Из Объект.Персонал Цикл
		Стр.Цена = ПолучитьЦенуНаРесурс(Объект.Организация, Объект.Сценарий, Стр.Должность, ТекущаяДата());
		Стр.Сумма = Стр.Цена * Стр.КоличествоСтавок * Стр.КоличествоЧасов;
	КонецЦикла;
	
	Для Каждого Стр Из Объект.Материалы Цикл
		Стр.Цена = ПолучитьЦенуНаРесурс(Объект.Организация, Объект.Сценарий, Стр.Материал, ТекущаяДата());
		Стр.Сумма = Стр.Цена * Стр.Количество;
	КонецЦикла;
	
	Для Каждого Стр Из Объект.Инструменты Цикл
		Стр.Цена = ПолучитьЦенуНаРесурс(Объект.Организация, Объект.Сценарий, Стр.Инструмент, ТекущаяДата());
		Стр.Сумма = Стр.Цена * Стр.КоличествоЧасов;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
